frontend/modules/item/models/Items.php

    public static function getAllItems()
    {
        $query = self::find()
            ->joinWith([
                'cons',
                'pros',
                'images',
                'specificationsItems',
            ]);
        return $query->asArray()->all();
---
SELECT `items`.* FROM `items` LEFT JOIN `cons` ON `items`.`id` = `cons`.`items_id` LEFT JOIN `pros` ON `items`.`id` = `pros`.`items_id` LEFT JOIN `new_image` ON `items`.`id` = `new_image`.`items_id` LEFT JOIN `specifications_items` ON `items`.`id` = `specifications_items`.`items_id`