frontend/modules/category/controllers/AdminController.php

    public function actionCreate()
    {
        $model = new CategoryBase();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `category` (`parent_id`, `name`, `nameSingular`, `typePrefix`, `urlOld`, `imagesDir`, `descShort`, `descTop`, `descBottom`, `brandId`, `filter`, `filterScatter`, `isCatalogDropDown`, `isExtraBrand`, `isShowDescShort`, `sort`, `group`, `addProducts`, `largeProductsList`, `smallProductsList`, `googleProductCategory`, `googleProductType`, `yandexUtmCampaign`, `yandexSalesNotes`, `position`, `top_name`, `new_site_desc_bottom`, `new_site_desc_top`, `images_for_preview`) VALUES (0, 'test', 'test', '', '', '', '', '', '', NULL, '', NULL, NULL, NULL, NULL, NULL, NULL, '', '', '', NULL, '', '', '', NULL, '', '', '', '')