frontend/modules/item/controllers/AdminController.php

    public function actionIndex()
    {

        $model = new \app\modules\item\models\Items();

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            if (!$model->save()) {
---
INSERT INTO `items` (`description`, `name`, `anchor`, `img`, `link_amazon`, `imgPreview`) VALUES ('123', '123', '', '', '', 'test')