frontend/modules/url/models/Url.php

SELECT * FROM `new_url` WHERE alias = 'shiatsu' AND status = 1
---
    public static function getByAlias($alias, $status = self::STATUS_ENABLE)
    {
//		return self::getDb()->cache(function($db) use ($alias, $status) {
        return self::find()->where(
            'alias = :alias AND status = :status',
            [
                ':alias' => $alias,
                ':status' => $status,
            ]
        )->one();